"""
Колесников Павел.
HW-2 от 12.12.2023
Перевод секунд и градусов
"""
# Перевод количества секунд
second_time = int(input("Введите количество секунд: "))

print(f'В указанном количестве секунд {second_time}:\n'
f'Часов: {second_time // 3600}\n'
f'Минут: {(second_time - (3600 * (second_time // 3600))) // 60}\n'
f'Секунд: {second_time - ((3600 * second_time // 3600) // 60) * 60}\n\n')

# Перевод температуры
user_temp = round(float(input('Введите количество градусов: ')),2)
print(f'В указанном количестве градусов цельсия: {user_temp}\n'
f'Градусов Кельвина: {round(user_temp + 273.15, 2)}\n'
f'Градусов Фаренгейта: {round((user_temp * 9 / 5) + 32, 2)}\n'
f'Градусов Реомюра: {round(user_temp * 0.8, 2)}')